tutorials/complex_cylinder/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-06;

boundaryField
{
    top
    {
        type            calculated;
        value           uniform 1e-06;
    }
    bottom
    {
        type            calculated;
        value           uniform 1e-06;
    }
    inlet
    {
        type            calculated;
        value           uniform 1e-06;
    }
    outlet
    {
        type            calculated;
        value           uniform 1e-06;
    }
    frontAndBack
    {
        type            calculated;
        value           uniform 1e-06;
    }
    cylinder
    {
        type            nutUWallFunction;
        value           uniform 1e-06;
    }
}


// ************************************************************************* //
