tutorials/complex_cylinder/system/plane_dual/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|elevation)"
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        relTol          1e-6;
        minIter         0;

    }

    pFinal
    {
        $p
 	 	tolerance        1e-8;
        relTol           0.0;
    }
    "(U)"
    {	
        solver          PBiCG;
        preconditioner  DILU;
        minIter          2;
        maxIter          1000;
        tolerance        1e-08;
        relTol           0;
    }

    "(C|k|omega|epsilon)"
    {
        solver          PBiCGStab;
	smoother		DIC;
        preconditioner  DILU;
        tolerance   	1e-07;
        relTol          0.0;
        minIter          1;
        maxIter          1000;
    }

}

PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors     3;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}


PISO
{
    nCorrectors     3;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    C          0.5;
    U          0.5;
    p          0.7;
    k          0.7;
    epsilon    0.7;
}


// ************************************************************************* //
